Revit 2027 API
BuiltInFailures.SketchFailures.StairOnlyOneConnectedBoundary Property
 Stairs require no less than two boundaries (chains of one or more Boundary Lines)."
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId StairOnlyOneConnectedBoundary { get; }
Public Shared ReadOnly Property StairOnlyOneConnectedBoundary As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ StairOnlyOneConnectedBoundary {
	FailureDefinitionId^ get ();
}
static member StairOnlyOneConnectedBoundary : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace